000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИменаЛюдей/ИменаЛюдей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИменаЛюдей</name>
  <attributes>
    <name>НаименованиеЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеУкраинское</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеУкраинскоеЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОпределяетПол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ИменаЛюдей/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		Если ПустаяСтрока(НаименованиеЛатиница) Тогда

			НаименованиеЛатиница = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(Наименование);

		КонецЕсли;

		Если ПустаяСтрока(НаименованиеУкраинскоеЛатиница) Тогда

			НаименованиеУкраинскоеЛатиница = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(НаименованиеУкраинское);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры
